### Terraform Plan Results

#### Format Check: `failure`
#### Init: `success`
#### Validate: `success`
#### Plan: `success`

<details><summary>Show Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.demo will be created
  + resource "aws_s3_bucket" "demo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cloudburst-demo-sr"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "DeployedBy"  = "github-actions"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "CloudBurst Demo Bucket"
          + "TestTag"     = "pr-comment-test"
        }
      + tags_all                    = {
          + "DeployedBy"  = "github-actions"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "CloudBurst Demo Bucket"
          + "TestTag"     = "pr-comment-test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_versioning.demo will be created
  + resource "aws_s3_bucket_versioning" "demo" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_arn  = (known after apply)
  + bucket_name = "cloudburst-demo-sr"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @SafeEHA*